app/controllers/chamados_controller.rb

SELECT "chamados".* FROM "chamados" ORDER BY "chamados"."nome" ASC
SELECT COUNT(*) FROM "chamados"
---
    def index
        @chamados = Chamado.order :nome
        @chamados = Chamado.page(params[:page]).per(10)

SELECT  "chamados".* FROM "chamados" WHERE "chamados"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def show
        @chamado = Chamado.find(params[:id])

INSERT INTO "chamados" ("nome", "lastname", "departamento", "equipamento", "descricao", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        valores = params.require(:chamado).permit(:nome, :lastname, :departamento, :equipamento, :descricao, :data)
        @chamado = Chamado.new valores
        if @chamado.save

DELETE FROM "chamados" WHERE "chamados"."id" = ?  [["id", 12]]
---
    def destroy
        id = params[:id]
        Chamado.destroy id

SELECT "chamados".* FROM "chamados" WHERE (nome like 'Franklin')
---
    def busca
        @nome = params[:nome]
        @chamados = Chamado.where "nome like ?", "%#{@nome}%"

SELECT  "chamados".* FROM "chamados" WHERE "chamados"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def edit
        id = params[:id]
        @chamado = Chamado.find(id)